STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA65RI/Applications/BLE/BLE_Power_Peripheral/STM32_WPAN/App/app_ble.c
static void BleStack_Process_BG(void)
{
  if (BleStack_Process( ) == 0x0)
  {
    BleStackCB_Process( );
  }
}

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1U << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1U << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

/**
  * @brief  Notify the LL to resume the flow process
  * @param  None
  * @retval None
  */
static void BLE_ResumeFlowProcessCallback(void)
{
  /* Receive any events from the LL. */
  change_state_options_t notify_options;

  notify_options.combined_value = 0x0F;

  ll_intf_chng_evnt_hndlr_state( notify_options );
}

static void BLE_NvmCallback(SNVMA_Callback_Status_t CbkStatus)
{
  if (CbkStatus != SNVMA_OPERATION_COMPLETE)
  {
    /* Retry the write operation */
    SNVMA_Write (APP_BLE_NvmBuffer, BLE_NvmCallback);
  }
}

/* USER CODE BEGIN FD_LOCAL_FUNCTION */
static void fill_advData(uint8_t *p_adv_data, uint8_t tab_size)
{

  if (tab_size > 4)
  {
    p_adv_data[0] = 4;
    p_adv_data[1] = AD_TYPE_COMPLETE_LOCAL_NAME;
    p_adv_data[2] = 'P';
    p_adv_data[3] = 'W';
    p_adv_data[4] = 'R';
    p_adv_data[5] = tab_size - 6;
    p_adv_data[6] = AD_TYPE_MANUFACTURER_SPECIFIC_DATA;

    for(uint8_t i= 7; i <tab_size; i++ )
    {
      p_adv_data[i] = 0xFF;
    }
  }

}

/* USER CODE END FD_LOCAL_FUNCTION */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

tBleStatus BLECB_Indication( const uint8_t* data,
                          uint16_t length,
                          const uint8_t* ext_data,
                          uint16_t ext_length )
{
  uint8_t status = BLE_STATUS_FAILED;
  BleEvtPacket_t *phcievt = NULL;
  uint16_t total_length = (length+ext_length);

  UNUSED(ext_data);

  if (data[0] == HCI_EVENT_PKT_TYPE)
  {
    APP_BLE_ResumeFlowProcessCb.Callback = BLE_ResumeFlowProcessCallback;
    if (AMM_Alloc (CFG_AMM_VIRTUAL_APP_BLE,
                   DIVC((sizeof(BleEvtPacketHeader_t) + total_length), sizeof (uint32_t)),
                   (uint32_t **)&phcievt,
                   &APP_BLE_ResumeFlowProcessCb) != AMM_ERROR_OK)
    {
      LOG_INFO_APP("Alloc failed\n");
      status = BLE_STATUS_FAILED;
    }
    else if (phcievt != (BleEvtPacket_t *)0 )
    {
      phcievt->evtserial.type = HCI_EVENT_PKT_TYPE;
      phcievt->evtserial.evt.evtcode = data[1];
      phcievt->evtserial.evt.plen  = data[2];
      MEMCPY( (void*)&phcievt->evtserial.evt.payload, &data[3], data[2]);
      LST_insert_tail(&BleAsynchEventQueue, (tListNode *)phcievt);
      UTIL_SEQ_SetTask(1U << CFG_TASK_HCI_ASYNCH_EVT_ID, CFG_SEQ_PRIO_0);
      status = BLE_STATUS_SUCCESS;
    }
  }
  else if (data[0] == HCI_ACLDATA_PKT_TYPE)
  {
    status = BLE_STATUS_SUCCESS;
  }
  return status;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
void APP_BLE_Key_Button1_Action(void)
{

  switch(bleAppContext.Device_Connection_Status)
  {
    case APP_BLE_CONNECTED_SERVER:
    {
      if(bleAppContext.ButtonTransferReq!= BLE_APP_TRANSFER_REQ_OFF)
      {
        bleAppContext.ButtonTransferReq = BLE_APP_TRANSFER_REQ_OFF;
        UTIL_TIMER_Stop(&bleAppContext.RX_Int_timer_Id);
      }
      else
      {

        bleAppContext.ButtonTransferReq = BLE_APP_TRANSFER_REQ_ON;
        UTIL_TIMER_StartWithPeriod(&bleAppContext.RX_Int_timer_Id, NOTIFY_TX_INT_MS);

      }
      BleStackCB_Process();
    }
    default:break;
  }

  return;
}

void APP_BLE_Key_Button2_Action(void)
{
  switch(bleAppContext.Device_Connection_Status)
  {
    case APP_BLE_ADV_FAST:
    {
      /*stop advertising*/
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
      /* Start advertising in LP */
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_LP);

      break;
    }
    case APP_BLE_ADV_LP:
    {
      /*stop advertising*/
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
      /* Start advertising in Fast */
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
      break;
    }

    case APP_BLE_ADV_NON_CONN_FAST:
    {
      /*stop advertising*/
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
      /* Start advertising in LP */
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_NON_CONN_START_LP);

      break;
    }
    case APP_BLE_ADV_NON_CONN_LP:
    {
      /*stop advertising*/
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
      /* Start advertising in Fast */
      APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_NON_CONN_START_FAST);
      break;
    }
    case APP_BLE_CONNECTED_SERVER:
    {
      APP_BLE_Procedure_Gap_General(PROC_GAP_GEN_PHY_TOGGLE);

      break;
    }
    default:break;
  }
  BleStackCB_Process();

}

void APP_BLE_Key_Button3_Action(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    switch(bleAppContext.Device_Connection_Status)
    {
      case APP_BLE_ADV_LP:
      case APP_BLE_ADV_FAST:
      {
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_NON_CONN_START_FAST);
        break;
      }
      case APP_BLE_ADV_NON_CONN_LP:
      case APP_BLE_ADV_NON_CONN_FAST:
      {
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_STOP);
        APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_ADVERTISE_START_FAST);
        break;
      }
      default:break;
    }
  }
  else
  {
    APP_BLE_Procedure_Gap_Peripheral(PROC_GAP_PERIPH_CONN_PARAM_UPDATE);
  }
 BleStackCB_Process();

}

void Check_Button(void)
{
  uint8_t B1,B2,B3;
    if(PWR_CO_GPIO_Status == PWR_CO_GPIO_OFF)
  {
    return;
  }
  else
  {
   if (PWR_CO_GPIO_Status != PWR_CO_GPIO_OFF)
  {
    MX_GPIO_Init();
  }

    B1 = HAL_GPIO_ReadPin(B1_GPIO_Port,B1_Pin);
    B2 = HAL_GPIO_ReadPin(B2_GPIO_Port,B2_Pin);
    B3 = HAL_GPIO_ReadPin(B3_GPIO_Port,B3_Pin);

  if ((B1 != 1)&&(bleAppContext.B1_Switch == 1))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_1, CFG_SEQ_PRIO_0);
    bleAppContext.B1_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B1 != 0)
  {
    bleAppContext.B1_Switch = 1;
  }
     if ((B2 != 1)&&(bleAppContext.B2_Switch == 1))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_2, CFG_SEQ_PRIO_0);
    bleAppContext.B2_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B2 != 0)
  {
    bleAppContext.B2_Switch = 1;
  }

  if ((B3 != 1)&&(bleAppContext.B3_Switch == 1))
  {
    UTIL_SEQ_SetTask(1U << CFG_TASK_BUTTON_3, CFG_SEQ_PRIO_0);
    bleAppContext.B3_Switch = 0;
    PWR_CO_GPIO_Status = PWR_CO_GPIO_TIM_RESET_ON;
  }
  else if (B3 != 0)
  {
    bleAppContext.B3_Switch = 1;
  }

  if (PWR_CO_GPIO_Status == PWR_CO_GPIO_TIM_RESET_ON)
  {
    UTIL_TIMER_Stop(&bleAppContext.DISABLE_IOs);
    UTIL_TIMER_StartWithPeriod(&bleAppContext.DISABLE_IOs, Setup_Time);
    PWR_CO_GPIO_Status = PWR_CO_GPIO_ON;
  }
  }
}

static void Send_Data_Req(void *arg)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_PWR_TX_ID, CFG_SEQ_PRIO_0);
  return;
}

static void GPIO_Off_Req(void *arg)
{
  UTIL_SEQ_SetTask(1 << CFG_TASK_GPIO_OFF_ID, CFG_SEQ_PRIO_0);
  return;
}

/* USER CODE END FD_WRAP_FUNCTIONS */
